## Plan Result (@infrastructure/account-data-deleter-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/15834855015)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938
* Replace
  * aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938 will be updated in-place
  ~ resource "aws_appautoscaling_target" "data-deleter-app_application_autoscaling_autoscaling_target_02FF0938" {
        id                 = "service/AccountDataDeleter-Prod/AccountDataDeleter-Prod"
      ~ max_capacity       = 200 -> 100
      ~ min_capacity       = 150 -> 10
        tags               = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07 must be replaced
-/+ resource "aws_ecs_task_definition" "data-deleter-app_application_ecs_service_ecs-task_243DED07" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:926" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    environment            = [
                        {
                            name  = "DATABASE_READ_PORT"
                            value = "3306"
                        },
                        {
                            name  = "DATABASE_TZ"
                            value = "US/Central"
                        },
                        {
                            name  = "DATABASE_WRITE_PORT"
                            value = "3306"
                        },
                        {
                            name  = "EVENT_BUS_NAME"
                            value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                        {
                            name  = "EXPORT_REQUEST_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Export-Request"
                        },
                        {
                            name  = "EXPORT_REQUEST_STATE_TABLE"
                            value = "ADD-Prod-Export-Request-State"
                        },
                        {
                            name  = "LIST_EXPORT_ARCHIVE_PREFIX"
                            value = "archives"
                        },
                        {
                            name  = "LIST_EXPORT_BUCKET"
                            value = "com.getpocket-prod.list-exports"
                        },
                        {
                            name  = "LIST_EXPORT_PARTS_PREFIX"
                            value = "parts"
                        },
                        {
                            name  = "LIST_IMPORTS_BUCKET"
                            value = "com.getpocket-prod.list-imports"
                        },
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                        {
                            name  = "OTLP_COLLECTOR_URL"
                            value = "https://otel-collector.readitlater.com:443"
                        },
                        {
                            name  = "SQS_ANNOTATIONS_EXPORT_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Annotations-Export"
                        },
                        {
                            name  = "SQS_BATCH_DELETE_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue"
                        },
                        {
                            name  = "SQS_IMPORT_BATCH_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-List-Import-Batches"
                        },
                        {
                            name  = "SQS_IMPORT_FILE_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-List-Import-Files"
                        },
                        {
                            name  = "SQS_LIST_EXPORT_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-List-Export"
                        },
                    ]
                    essential              = true
                    healthCheck            = {
                        command     = [
                            "CMD-SHELL",
                            "curl -f http://localhost:4015/health || exit 1",
                        ]
                        interval    = 15
                        retries     = 3
                        startPeriod = 0
                        timeout     = 5
                    }
                    image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/accountdatadeleter-prod-app:latest"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/Backend/AccountDataDeleter-Prod/ecs/app"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "app"
                    portMappings           = [
                        {
                            containerPort = 4015
                            hostPort      = 4015
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "DATABASE_READ_HOST"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:read_host::"
                        },
                        {
                            name      = "DATABASE_READ_PASSWORD"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:read_password::"
                        },
                        {
                            name      = "DATABASE_READ_USER"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:read_username::"
                        },
                        {
                            name      = "DATABASE_WRITE_HOST"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:write_host::"
                        },
                        {
                            name      = "DATABASE_WRITE_PASSWORD"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:write_password::"
                        },
                        {
                            name      = "DATABASE_WRITE_USER"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:write_username::"
                        },
                        {
                            name      = "EXPORT_SIGNEDURL_USER_ACCESS_KEY_ID"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/EXPORT_USER_CREDS:accessKeyId::"
                        },
                        {
                            name      = "EXPORT_SIGNEDURL_USER_SECRET_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/EXPORT_USER_CREDS:secretAccessKey::"
                        },
                        {
                            name      = "FXA_CLIENT_ID"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Web/Prod/FIREFOX_WEB_AUTH_CLIENT_ID"
                        },
                        {
                            name      = "FXA_CLIENT_SECRET"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Web/Prod/FIREFOX_WEB_AUTH_CLIENT_SECRET"
                        },
                        {
                            name      = "FXA_OAUTH_URL"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Web/Prod/FIREFOX_AUTH_OAUTH_URL"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/AccountDataDeleter/Prod/SENTRY_DSN"
                        },
                        {
                            name      = "STRIPE_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/AccountDataDeleter/Prod/STRIPE_KEY"
                        },
                        {
                            name      = "UNLEASH_ENDPOINT"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                        {
                            name      = "UNLEASH_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/UNLEASH_KEY"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ cpu                      = "1024" -> "2048" # forces replacement
      ~ id                       = "AccountDataDeleter-Prod" -> (known after apply)
      ~ memory                   = "8192" -> "16384" # forces replacement
      ~ revision                 = 926 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn                                                                              = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:926" -> (known after apply)
```

</details>







## :warning: Errors

* add a label @infrastructure/account-data-deleter-production/destroy: POST https://api.github.com/repos/Pocket/pocket-monorepo/issues/1052/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]


<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":1052,"Program":"tfcmt","SHA1":"3783eea81730597358dc9de85803dbe932a9bbc5","Target":"@infrastructure/account-data-deleter-production","Vars":{},"WorkflowName":"Account Data Deleter"} -->